
// ****************************************************************************
//
//                                   USART
//
// ****************************************************************************
// USART1/2/3 are USART (synchronous asynchronous),
// USART4/5/6/7/8 are UART (asynchronous).
// For CH32V203C8: USART4 is USART (synchronous asynchronous),

#if USE_USART		// 1=use USART peripheral

#ifndef _SDK_USART_H
#define _SDK_USART_H

#ifdef __cplusplus
extern "C" {
#endif

// USART registers
typedef struct {
	io32	STATR;		// 0x00: status register
	io32	DATAR;		// 0x04: data register
	io32	BRR;		// 0x08: baud rate register
	io32	CTLR1;		// 0x0C: control register 1
	io32	CTLR2;		// 0x10: control register 2
	io32	CTLR3;		// 0x14: control register 3
	io32	GPR;		// 0x18: protection and prescaler register
	io32	CTLR4;		// 0x1C: control register 4
} USART_t;
STATIC_ASSERT(sizeof(USART_t) == 0x20, "Incorrect USART_t!");
#define USART1	((USART_t*)USART1_BASE)	// 0x40013800
#define USART2	((USART_t*)USART2_BASE)	// 0x40004400
#define USART3	((USART_t*)USART3_BASE)	// 0x40004800
#define USART4	((USART_t*)USART4_BASE)	// 0x40004C00
#define USART5	((USART_t*)USART5_BASE)	// 0x40005000
#define USART6	((USART_t*)USART6_BASE)	// 0x40001800
#define USART7	((USART_t*)USART7_BASE)	// 0x40001C00
#define USART8	((USART_t*)USART8_BASE)	// 0x40002000

// Get USART periphery from USART index 1.. (returns NULL if not valid)
INLINE USART_t* USART_GetHw(int inx)
{
	if (inx == 1) return USART1;
	if (inx == 2) return USART2;
	if (inx == 3) return USART3;
	if (inx == 4) return USART4;
	if (inx == 5) return USART5;
	if (inx == 6) return USART6;
	if (inx == 7) return USART7;
	if (inx == 8) return USART8;
	return NULL;
}

// Get USART index 1.. from USART periphery (returns -1 if not valid)
