
// ****************************************************************************
//
//                                Timer
//
// ****************************************************************************
/*
Timer description
-----------------
Input clock CK_PSC, select source:
	- SMCFGR.ECE is 0, TIM2_EC2Disable(), do not used external clock mode 2, select source by TIMx_InMode() TIM_INMODE_*:
		- TIM_INMODE_INT: internal clock CK_INT, source is HB bus clock
		- TIM_INMODE_ENC1..3: encoder mode 1..3, count edges of TI1FP1 and TI2FP2
		- TIM_INMODE_RESET: reset mode, trigger input TRGI will inicialize counter and generate update
			clock source is TRGI, select trigger by TIMx_Trig() TIM_TRIG_*, see below
		- TIM_INMODE_GATE: gated mode, counter clock enabled by level od TRGI input
			clock source is TRGI, select trigger by TIMx_Trig() TIM_TRIG_*, see below
		- TIM_INMODE_TRIG: trigger mode, counter is started on rising edge of TRGI
			clock source is TRGI, select trigger by TIMx_Trig() TIM_TRIG_*, see below
		- TIM_INMODE_EDGE: rising edge of selected trigger input TRGI drives counter
			clock source is TRGI, select trigger by TIMx_Trig() TIM_TRIG_*
			- TIM_TRIG_ITR0..3 internal trigger ITR0..3
			- TIM_TRIG_TI1FED edge detector of TI1, comparison of the signal after capturing channel 1
			- TIM_TRIG_TI1FP1..2 filtered timer input TI1FP1..2, comparison of the capture channel
			- TIM_TRIG_ETRF external trigger input ETRF, input from external clock input


	- input from exclusive pins TIMx_CHx
	- output to the pins TIMx_CHx and TIMx_CHxN (complementary)
	- input from each channel supports filtering, dividing edge detection and mutual triggering between channels
	- each channel has compare capture register CHxCVR to compare with main counter CNT to output pulses

	Input from external TIx pin is filtered by down counter TIMx_Filter() TIM_FILTER_* and generates TIxF flag.
	Signal TIxF is processed by edge detector and generates signals TIxFP1, TIxFP2 and TIxFED signals.

	Input compare mode:
		Capture event occurs when a determined edge on the ICxPS signal is detected,
		and current value of counter is latched into compare capture register CHxCVR.
		CCxIF flag is set and interrupt or DMA occurs.
			1) Configure CCxS input mode TIMx_CC1Sel() TIM_CCSEL_*
			2) Select input filter TIMx_IC1Filter() TIM_FILTER_*
			3) Select polarity TIMx_IC1Fall()/TIMx_IC1Rise()
			4) Enable capture TIMx_CC1Enable()
			5) Enable interrupt TIMx_CC1IntEnable() or DMA TIMx_CC1DMAReqEnable()
			When captured pulse is input to TI1, the value of counter CNT is recorded
			in the compare capture register, CC1IF is set, interrupt or DMA is generated.

	Compare output mode:
		Output changes when counter agrees with compare register.
			1) Configure CCxS output mode TIMx_CC1Sel() TIM_CCSEL_*
			2) Setup auto-reload value TIMx_Load()
			3) Setup value to be compared TIMx_Comp1()
			4) Enable interrupt TIMx_CC1IntEnable()
			5) Disable preload compare register TIMx_OC1PreDisable()
			6) Setup compare mode TIMx_OC1Mode() TIM_COMP_*
			7) Setup output polarity TIMx_OC1Low() or TIMx_OC1High()
			8) Enable output TIMx_CC1Enable()
			9) Start timer TIMx_Enable()
	Force output mode:
		Set compare mode TIMx_OC1Mode() to TIM_COMP_INVALID (low) or TIM_COMP_VALID (high).

	PWM input mode:
		Used to measure duty cycle and frequency. PWM occupies two compare capture channels
		with opposite polarity.
			1) Select TI1 as IC1 input TIMx_CC1Sel() TIM_CCSEL_TI1
			2) Select TI1FP1 to rising edge TIMx_IC1Rise()
			3) Select TI1 as IC2 input TIMx_CC2Sel() TIM_CCSEL_TI1
			4) Select TI1FP1 to falling edge TIMx_IC2Fall()
			5) Select TI1FP1 as clock source TIMx_Trig() TIM_TRIG_TI1FP1
			6) Set reset mode TIMx_InMode() TIM_INMODE_RESET
			7) enable input capture TIMx_CC1Enable() and TIMx_CC2Enable()

	PWM output mode:
			1) Set TIMx_OC1Mode() to TIM_COMP_PWM1 or TIM_COMP_PWM2.
			2) Enable preload register TIMx_OC1PreEnable()
			3) Enable auto-reload TIMx_AutoReloadEnable() (defines timer period)
			4) Generate first update with TIMx_Update()

			In PWM mode, core counter and compare register are always comparing,
			outputing edge-aligned or center-aligned PWM signals.

			Edge alignment: counter is incremented or decremented, OCxREF changes by compare register
			Central alignment: counter is incremented and decremented
*/

#if USE_TIM		// 1=use timers

#ifndef _SDK_TIM_H
#define _SDK_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

// Timer registers
typedef struct {
	io32	CTLR1;		// 0x00: control register 1
	io32	CTLR2;		// 0x04: control register 2
	io32	SMCFGR;		// 0x08: slave mode control register
	io32	DMAINTENR;	// 0x0C: DMA/interrupt enable register
	io32	INTFR;		// 0x10: interrupt status register
	io32	SWEVGR;		// 0x14: even generation register
	io32	CHCTLR1;	// 0x18: compare/capture control register 1
	io32	CHCTLR2;	// 0x1C: compare/capture control register 2
	io32	CCER;		// 0x20: compare/capture enable register
	io32	CNT;		// 0x24: counter
	io32	PSC;		// 0x28: prescaler
	io32	ATRLR;		// 0x2C: auto-reload value register
	io32	RPTCR;		// 0x30: recurring count value register
	io32	CH1CVR;		// 0x34: compare/capture register 1
	io32	CH2CVR;		// 0x38: compare/capture register 2
	io32	CH3CVR;		// 0x3C: compare/capture register 3
	io32	CH4CVR;		// 0x40: compare/capture register 4
	io32	BDTR;		// 0x44: brake and deadband register
	io32	DMACFGR;	// 0x48: DMA control register
	io32	DMAADR;		// 0x4C: DMA address register	
} TIM_t;
STATIC_ASSERT(sizeof(TIM_t) == 0x50, "Incorrect TIM_t!");
#define TIM1	((TIM_t*)TIM1_BASE)	// 0x40012C00
#define TIM2	((TIM_t*)TIM2_BASE)	// 0x40000000

// central alignment mode
#define TIM_ALIGN_EDGE		0	// edge alignment, counter counts up or down
#define TIM_ALIGN_DOWN		1	// central alignment 1, counts up and down, compare flag is set on down direction
#define TIM_ALIGN_UP		2	// central alignment 2, counts up and down, compare flag is set on up direction
#define TIM_ALIGN_BOTH		3	// central alignment 2, counts up and down, compare flag is set on both directions

// clock division ratio of dead time generator
#define TIM_CKD_DIV1		0	// no division
#define TIM_CKD_DIV2		1	// 2x division
#define TIM_CKD_DIV4		2	// 4x division

// master to slave synchronization mode (select trigger output signal)
#define TIM_MSSYNC_RESET	0	// UG bit of Reset-TIM_EGR register
#define TIM_MSSYNC_ENABLE	1	// counter enable signal
